# Извлечение срезов с отрицательным шагом
# При k<0 порядок использования i и j должен быть заменен на противоположный: my_str[j:i:k]
'my_str[::-1]'
#'DFCWBQA'
# Операторы сравнения со строками
# Проверка вхождения in и not in 

# Приведение типов : int(), float(), bool(), str()
a = int(input())
print(a)
print(type(a))

# Задача 1-2-2-1. Прочитайте строку с клавиатуры и выведите на экран ее длину.
a = input()
print(len(a))
# Задача 1-2-2-2. Прочитайте строку с клавиатуры и выведите на экран её же, приведенную к верхнему регистру.
# Задача 1-2-2-3. На вход программе подается строка - объект типа str. Напишите программу, которая заменяет каждый символ 'a' в строке на символ 'o', а каждый символ 'T' на символ 'R' и выводит результат на экран.